Autodesk.Revit.DB.OrdinateDimensionSetting.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.OrdinateDimensionSetting.OriginTickMarkId
Specifies the id of the tick mark element to use for the dimension origin.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017 Subscription Update

Autodesk.Revit.DB.OrdinateDimensionSetting.OriginVisibility
Specifies thevisibility of the origin witness line for the ordinate dimension (this is the first witness line in the string).
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2017 Subscription Update

Autodesk.Revit.DB.OrdinateDimensionSetting.TextPosition
Specifies the dimension text position.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2017 Subscription Update

Autodesk.Revit.DB.OrdinateDimensionSetting.TextOrientation
Specifies where to align the dimension text.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2017 Subscription Update

Autodesk.Revit.DB.OrdinateDimensionSetting.DimensionLineStyle
Specifies the dimension line style.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2017 Subscription Update

Autodesk.Revit.DB.OrdinateDimensionSetting.DimensionLineLength
Specifies the dimension line segment length. This setting is enabled when Dimension Line Style is Segmented.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for dimensionLineLength must be greater than 0 and no more than 30000 feet.
Since:
2017 Subscription Update

Autodesk.Revit.DB.OrdinateDimensionSetting.#ctor
Constructs a new OrdinateDimensionSetting object with default settings.
Since:
2017 Subscription Update

Autodesk.Revit.DB.OrdinateDimensionSetting
Represents a collection of Ordinate Dimension settings that can be associated to an ordinate DimensionType.
Since:
2017 Subscription Update